org/topics/domaintakeover.org
:PROPERTIES:
:ID:       362b2429-fcde-4b94-a504-4beb416ac6a1
:END:
#+created: 20191125130352512
#+modified: 20210519185714076
#+origin: https://github.com/EdOverflow/can-i-take-over-xyz https://aws.amazon.com/blogs/networking-and-content-delivery/continually-enhancing-domain-security-on-amazon-cloudfront/  https://www.mindpointgroup.com/blog/pen-test/cloudfront-hijacking/ https://0xpatrik.com/subdomain-takeover-ns/ https://www.hackerone.com/blog/Guide-Subdomain-Takeovers https://github.com/aboul3la/Sublist3r 
#+revision: 0
#+tags: DNS AppSec
#+title: Domain Takeover
#+tmap.id: bd7c534f-a0fb-4fc1-ac93-e09fd1f8aca3
#+type: text/vnd.tiddlywiki

Basic scenario for hijacking:

- The domain =test.disloops.com= is a =CNAME= record that points to disloops.com
- The =disloops.com= domain is set up to use a [[#CloudFront][CloudFront]] distribution.
- Because =test.disloops.com= was not added to the "Alternate Domain Names (CNAMEs)" field for the distribution, requests to =test.disloops.com= will fail.
- Another user can create a [[#CloudFront][CloudFront]] distribution and add test.disloops.com to the "Alternate Domain Names (CNAMEs)" field to hijack the domain.

* CNAME in context of CFN
:PROPERTIES:
:CUSTOM_ID: cname-in-context-of-cfn
:END:

#+begin_quote
Before diving into the details, it is important to clarify that a [[#CloudFront][CloudFront]] alternate domain name (CNAME) i*s not the same thing* as the authoritative DNS domain name or canonical name, also known as a CNAME. These two entries are related by nature of establishing a link between two different entities, but each entry is separate and distinct from each other. The [[#CloudFront][CloudFront]] alternate domain name (CNAME) on a [[#CloudFront][CloudFront]] distribution allows you to serve your content using a custom CNAME from your DNS records, such as www.example.com, instead of the default domain that [[#CloudFront][CloudFront]] assigns, such as d123456abcdef8.cloudfront.net. Only the CNAME from your authoritative DNS records actually controls where your domain's traffic is pointed to and from which endpoint your traffic will be served to your end users.

#+end_quote

* Remediations
:PROPERTIES:
:CUSTOM_ID: remediations
:END:
| Service type                          | Remediation                                                                                                                                                                                                                                                                                                                  |
|---------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [[#AWS%2FS3][AWS/S3]]                 | =The specified bucket does not exist=                                                                                                                                                                                                                                                                                        |
| [[#AWS%2FCloudFront][AWS/CloudFront]] | not vulnerable anymore ([[https://aws.amazon.com/blogs/networking-and-content-delivery/continually-enhancing-domain-security-on-amazon-cloudfront/][official statement]]){.tc-tiddlylink-external rel="noopener noreferrer" target=“_blank”}, [[https://github.com/EdOverflow/can-i-take-over-xyz/issues/29][github issue]]) |
* Resources
- 2023-03-15 ◦ [[https://www.cyjax.com/2022/10/24/a-comprehensive-synopsis-of-217-subdomain-takeover-reports/][A comprehensive synopsis of 217 subdomain takeover reports]]
